tutorials/RisingBubble/interFreeRisingBubble-C3/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        //type            fixedFluxPressure;  
        //value           $internalField;
		type 		  zeroGradient;
    }

    outlet
    {
        type		fixedValue;
		value           uniform 0; //$internalField;
		//type            fixedFluxPressure;  
        //value           $internalField;
    }
    walls
    {
        //type            fixedFluxPressure;  
        //value           $internalField;
		type 		  zeroGradient;
    }

}


// ************************************************************************* //
