tutorials/RisingBubble/interFreeRisingBubble-C3/constant/dynamicMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version    9.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

// How often to refine
refineInterval  5;
// Field to be refinement on
field           alpha.water;
// Refine field inbetween lower..upper
lowerRefineLevel 0.001;
upperRefineLevel 0.999;
// If value < unrefineLevel unrefine
unrefineLevel   -0.5;//10
// Have slower than 2:1 refinement
nBufferLayers   2;
// Refine cells only up to maxRefinement levels
maxRefinement   2;
// Stop refinement if maxCells reached
maxCells        900000;
// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi U)
    (nHatf none)
    (rhoPhi none)
    (ghf none)
    (alphaPhi0.water none)
    (phi_0 U_0)
	(alphaPhi0.water_0 none)
);
// Write the refinement level as a volScalarField
dumpLevel       true;


// ************************************************************************* //
